# Size Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DetailCurveArray..::..Size Property
DetailCurveArray Class See Also
---
Returns the number of objects that are in the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Size { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property Size As Integer
	Get
```

Visual C++
---
```text
public:
virtual property int Size {
	int get ();
}
```

# See Also
DetailCurveArray Class
Autodesk.Revit.DB Namespace